krogla_2stl_2file/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-10 -40 -15) // 0
    (10 -40 -15) // 1
    (10 20 -15) // 2
    (-10 20 -15) // 3
    (-10 -40 15) //4
    (10 -40 15) // 5
    (10 20 15) // 6
    (-10 20 15) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 20 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
		(0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
  
    front
    {
        type patch;
        faces
        (
        (1 5 4 0)
        );
    }

    back
    {
	type patch;
	faces
	(
		(3 7 6 2)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
